import { describe } from 'eslint/lib/rule-tester/rule-tester';
import { kolobok, NewYear } from '../src/homework4';
describe('ДЗ 4', () => {
  test('Функции "Колобок" загружается без ошибок', () => {
    expect(kolobok).toBeDefined();
    expect(typeof kolobok).toBe('function');
  });
  test('Функции "Новый год" загружается без ошибок', () => {
    expect(NewYear).toBeDefined();
    expect(typeof NewYear).toBe('function');
  });
  describe.each`
    n               |  expected
    ${'Бабушка'}    |  ${'от бабушки ушел'}
    ${'Дедушка'}    |  ${'от дедушки ушел'}
    ${'Заяц'}       |  ${'от зайца ушел'}
    ${'Волк'}       |  ${'от волка ушел'}
    ${'Медведь'}    |  ${'от медведя ушел'}
    ${'Лиса'}       |  ${'от лисы не ушел'}
    ${'Енот'}       |  ${'с этим не встречался'} 
    `
    ('Параметризированный тест для функции "Колобок"', ({n, expected}) => {
      test(`От кого ушел колобок`, () => {
        expect(kolobok(n)).toBe(expected);
      })
    });
    describe.each`
    cc              |  expected
    ${'Дед Мороз'}  |  ${'Дед Мороз! Дед Мороз! Дед Мороз!'}
    ${'Снегурочка'} |  ${'Снегурочка! Снегурочка! Снегурочка!'}
    ${'дед Мороз'}  |  ${'Неправильно зовете'}
    ${'снегурочка'} |  ${'Неправильно зовете'}
    ${'Медведь'}    |  ${'Неправильно зовете'}
    ${'Лиса'}       |  ${'Неправильно зовете'}
    ${' '}          |  ${'Неправильно зовете'} 
    `
    ('Параметризированный тест для функции "Новый год""', ({cc, expected}) => {
      test(`Кричим ${cc}`, () => {
        expect(NewYear(cc)).toBe(expected);
      })
    });
});
